In [5]:
import pandas as pd

In [6]:
# Gerando um dataframe
dataframe = pd.DataFrame({"Nome": ['Tonho', 'Nicão', 'Jão', 'Pedrão'], "Idade": [15, 26, 17, 28]})
print(dataframe)

     Nome  Idade
0   Tonho     15
1   Nicão     26
2     Jão     17
3  Pedrão     28

In [7]:
# Alterandonomes das colunas - Opcao I
dataframe.columns = ['Nome_Colega', 'Idade_Anos']
print(dataframe)

  Nome_Colega  Idade_Anos
0       Tonho          15
1       Nicão          26
2         Jão          17
3      Pedrão          28

In [9]:
# Alterando nome das colunas - Opcao II
dataframe = dataframe.rename(columns = {"Nome_Colega" : "Friends_Name", "Idade_Anos" : "Age_Years"})
print(dataframe)

  Friends_Name  Age_Years
0        Tonho         15
1        Nicão         26
2          Jão         17
3       Pedrão         28

In [14]:
# Excluindo a coluna "Age" do dataframe People
# O comando drop() é bastante útil nessa missão de excluir colunas no dataframe. O parâmetro inPlace=True permite apagar a
# coluna no dataframe original, sem precisar renomeá-lo.
people = pd.read_csv("PeopleAnalytics.txt", sep = "\t", usecols = ["Attrition", "Age", "StockOptionLevel"])
print(people)
people.drop(["Age"], axis = 1, inplace = True)
print(people)

     Attrition  Age  StockOptionLevel
0          Yes   41                 0
1           No   49                 1
2          Yes   37                 0
3           No   33                 0
4           No   27                 1
...        ...  ...               ...
1465        No   36                 1
1466        No   39                 1
1467        No   27                 1
1468        No   49                 0
1469        No   34                 0

[1470 rows x 3 columns]
     Attrition  StockOptionLevel
0          Yes                 0
1           No                 1
2          Yes                 0
3           No                 0
4           No                 1
...        ...               ...
1465        No                 1
1466        No                 1
1467        No                 1
1468        No                 0
1469        No                 0

[1470 rows x 2 columns]

In [15]:
# Criando um dataset
base = pd.DataFrame({'Data':['10/2/2021', '11/2/2021', '12/2/2021', '13/2/2021'],
                    'Evento':['Música', 'Poesia', 'Teatro', 'Comédia'],
                    'Custo':[10000, 5000, 15000, 2000]})
print(base)

        Data   Evento  Custo
0  10/2/2021   Música  10000
1  11/2/2021   Poesia   5000
2  12/2/2021   Teatro  15000
3  13/2/2021  Comédia   2000

In [16]:
# Calcula preço com desconto de 10% - Opcao I
base['Custo_com_Desconto'] = base.apply(lambda row: row.Custo - (row.Custo * 0.1), axis = 1)
print(base)

        Data   Evento  Custo  Custo_com_Desconto
0  10/2/2021   Música  10000              9000.0
1  11/2/2021   Poesia   5000              4500.0
2  12/2/2021   Teatro  15000             13500.0
3  13/2/2021  Comédia   2000              1800.0

In [17]:
# Calcula preco com desconto de 10% - Opcao II
base['Custo_com_Desconto_I'] = base['Custo'] - (0.1 * base['Custo'])
print(base)

        Data   Evento  Custo  Custo_com_Desconto  Custo_com_Desconto_I
0  10/2/2021   Música  10000              9000.0                9000.0
1  11/2/2021   Poesia   5000              4500.0                4500.0
2  12/2/2021   Teatro  15000             13500.0               13500.0
3  13/2/2021  Comédia   2000              1800.0                1800.0

In [19]:
# Categorizando a variavel Custo
# Existem inúmeras formas de criar uma variável categorizada a partir de uma variável original (seja ela numérica ou
# categórica). O método select() é muito útil nesse contexto.
import numpy as np
condicoes = [(base["Custo"] <= 2500), (base["Custo"] >2500) & (base["Custo"] <= 5000), (base["Custo"] > 5000)]
classe = ["Baixo", "Medio", "Alto"]
base['Fix_Custo'] = np.select(condicoes, classe, default = "Sem Info")
base

,Data,Evento,Custo,Custo_com_Desconto,Custo_com_Desconto_I,Fix_Custo
0,10/2/2021,Música,10000,9000.0,9000.0,Alto
1,11/2/2021,Poesia,5000,4500.0,4500.0,Medio
2,12/2/2021,Teatro,15000,13500.0,13500.0,Alto
3,13/2/2021,Comédia,2000,1800.0,1800.0,Baixo

In [20]:
# Agrupando os dados
df = pd.DataFrame({'coluna_I': ['A', 'B', 'C', 'A', 'C',
                               'C', 'B', 'D', 'D', 'A'],
                   'coluna_II': [5, 10, 15, 20, 25, 30, 
                             35, 40, 45, 50]})
df

  coluna_I  coluna_II
0        A          5
1        B         10
2        C         15
3        A         20
4        C         25
5        C         30
6        B         35
7        D         40
8        D         45
9        A         50

In [24]:
# Agrupando os dados da coluna I e somando os valores da coluna II para os valores unicos da coluna I - Opcao I
df1 = df.groupby('coluna_I')['coluna_II'].sum()
df1

coluna_I
A    75
B    45
C    70
D    85
Name: coluna_II, dtype: int64

In [26]:
# Agrupando os dados da coluna I e somando os valores da coluna II para os valores unicos da coluna I - Opcao II
df.groupby("coluna_I").agg({"coluna_II":sum})

          coluna_II
coluna_I
A                75
B                45
C                70
D                85